Dennis-van-Gils/DvG_Arduino_lock-in_amp/source_Atmel_Studio/project_LIA_SAMD21/LIA_SAMD21/main.c
/*
Arduino lock-in amplifier (LIA)
Phase-sensitive detector

Dennis van Gils

TODO: implement https://github.com/mpflaga/Arduino-MemoryFree
*/

#include <atmel_start.h>
#include <math.h>
#include <hpl_dma.h>
#include <stdio.h>
#include <stdlib.h>
#include <hpl_tcc_config.h>
#include "DvG_serial_command_listener.h"

#define FIRMWARE_VERSION "LIA v0.1.0"
#define VARIANT_MCK (48000000ul)     // Master clock frequency

volatile bool is_running = false;    // Is the lock-in amplifier running?
volatile bool is_serial_txc = false; // Is serial data sent out?
volatile bool is_serial_rxc = false; // Is serial data received?
volatile uint32_t millis = 0;        // Updated by SysTick, once every 1 ms

// Preprocessor trick to ensure enums and strings are in sync, so one can write
// 'WAVEFORM_STRING[Cosine]' to give the string 'Cosine'
#define FOREACH_WAVEFORM(WAVEFORM) \
        WAVEFORM(Cosine)    \
        WAVEFORM(Square)    \
        WAVEFORM(Sawtooth)  \
        WAVEFORM(Triangle)  \
        WAVEFORM(END_WAVEFORM_ENUM)
#define GENERATE_ENUM(ENUM) ENUM,
#define GENERATE_STRING(STRING) #STRING,

enum WAVEFORM_ENUM {
    FOREACH_WAVEFORM(GENERATE_ENUM)
};

static const char *WAVEFORM_STRING[] = {
    FOREACH_WAVEFORM(GENERATE_STRING)
};

// LIA output reference signal parameters
enum WAVEFORM_ENUM ref_waveform = Cosine;
double ref_freq;    // [Hz] Obtained frequency of reference signal
double ref_offs;    // [V]  Obtained voltage offset of reference signal
double ref_ampl;    // [V]  Voltage amplitude reference signal

// Look-up table (LUT) for fast DAC
#define MIN_N_LUT 20       // Min. allowed number of samples for one full period
#define MAX_N_LUT 1000     // Max. allowed number of samples for one full period
uint16_t LUT_wave[MAX_N_LUT] = {0}; // Look-up table allocation
uint16_t N_LUT;            // Current number of samples for one full period
bool is_LUT_dirty = false; // Does the LUT have to be updated with new settings?

// Analog port
#define A_REF 3.300        // [V] Analog voltage reference Arduino
#define ADC_INPUT_BITS 12
#if defined(_SAMD21_)
  #define DAC_OUTPUT_BITS 10
#elif defined(_SAMD51_)
  #define DAC_OUTPUT_BITS 12
#endif
#define MAX_DAC_OUTPUT_BITVAL ((uint16_t) (pow(2, DAC_OUTPUT_BITS) - 1))

// The number of samples to acquire by the ADC and to subsequently send out
// over serial as a single block of data
//#define BLOCK_SIZE 2500     // 2500 [# samples], where 1 sample takes up 16 bits
#define BLOCK_SIZE 500     // 2500 [# samples], where 1 sample takes up 16 bits

/*------------------------------------------------------------------------------
    TIMER_0
------------------------------------------------------------------------------*/

/* Channel CC[0] of timer TCC0 is set to match mode and will trigger output
events periodically at a fixed sample rate (say 50 kHz). It is the source that
triggers and synchronizes the DAC and ADC conversions.

The DAC buffer is N_LUT samples long, corresponding to a full period of
the output waveform. The frequency of the output waveform is hence changed by
increasing or decreasing N_LUT.

The ADC buffer is BLOCK_SIZE samples long and is independent of the DAC.
Whenever the ADC buffer is completely filled up, it is automatically sent out
over the serial port by the direct memory access controller (DMAC). A double
buffer is employed, called TX_buffer_A and TX_buffer_B.

A digital trigger signal that is in sync with every full period of the output
waveform is made available on a digital output pin, useful for connecting up
an oscilloscope.
*/
#define TCC0_PER_CORRECTION 1  // Might be something wrong in the ASF4 library?
const double SAMPLING_PERIOD_us = (CONF_TCC0_PER + TCC0_PER_CORRECTION) *
                                  (1000000. / (CONF_GCLK_TCC0_FREQUENCY /
                                               CONF_TCC0_PRESCALE));
const double SAMPLING_RATE_Hz = (double) CONF_GCLK_TCC0_FREQUENCY /
                                CONF_TCC0_PRESCALE /
                                (CONF_TCC0_PER + TCC0_PER_CORRECTION);

/*------------------------------------------------------------------------------
    Double buffer: TX_buffer_A & TX_buffer_B
------------------------------------------------------------------------------*/

// Serial transmission sentinels: start and end of message
const char SOM[] = {0x00, 0x80, 0x00, 0x80, 0x00, 0x80, 0x00, 0x80, 0x00, 0x80};
const char EOM[] = {0xff, 0x7f, 0x00, 0x00, 0xff, 0x7f, 0x00, 0x00, 0xff, 0x7f};

/* The serial transmit buffer will contain a single block of data:
 [SOM,                                              {size = 10 bytes}
  (uint32_t) number of buffer being send            {size =  4 bytes}
  (uint32_t) millis timestamp at start of block     {size =  4 bytes}
  (uint16_t) micros part of timestamp               {size =  2 bytes}
  (uint16_t) phase index LUT_wave at start of block {size =  2 bytes}
  BLOCK_SIZE x (uint16_t) ADC readings 'sig_I'      {size = BLOCK_SIZE * 2 bytes}
  EOM]                                              {size = 10 bytes}
to be transmitted by DMAC
*/
#define N_BYTES_SOM     (sizeof(SOM))
#define N_BYTES_COUNTER (4)
#define N_BYTES_MILLIS  (4)
#define N_BYTES_MICROS  (2)
#define N_BYTES_PHASE   (2)
#define N_BYTES_SIG_I   (BLOCK_SIZE * 2)
#define N_BYTES_EOM     (sizeof(EOM))

#define N_BYTES_TX_BUFFER (N_BYTES_SOM + \
                           N_BYTES_COUNTER + \
                           N_BYTES_MILLIS + \
                           N_BYTES_MICROS + \
                           N_BYTES_PHASE + \
                           N_BYTES_SIG_I + \
                           N_BYTES_EOM)

volatile uint32_t TX_buffer_counter = 0;
volatile bool using_TX_buffer_A = true; // When false: Using TX_buffer_B
static uint8_t TX_buffer_A[N_BYTES_TX_BUFFER] = {};
static uint8_t TX_buffer_B[N_BYTES_TX_BUFFER] = {};

#define TX_BUFFER_OFFSET_COUNTER (N_BYTES_SOM)
#define TX_BUFFER_OFFSET_MILLIS  (TX_BUFFER_OFFSET_COUNTER + N_BYTES_COUNTER)
#define TX_BUFFER_OFFSET_MICROS  (TX_BUFFER_OFFSET_MILLIS  + N_BYTES_MILLIS)
#define TX_BUFFER_OFFSET_PHASE   (TX_BUFFER_OFFSET_MICROS  + N_BYTES_MICROS)
#define TX_BUFFER_OFFSET_SIG_I   (TX_BUFFER_OFFSET_PHASE   + N_BYTES_PHASE)

// Outgoing serial string
#define MAXLEN_STR_BUFFER 64
char str_buffer[MAXLEN_STR_BUFFER];
char usb_buffer[MAXLEN_STR_BUFFER];
struct io_descriptor* io;

// Microcontroller unit (mcu) unique identifier (uid) number
uint8_t mcu_uid[16];

